Student: Satish Byrow

#**1. Goal**
- For this project, you have been hired to produce a MySQL database on Movies from a subset of IMDB's publicly available dataset. Ultimately, you will use this database to analyze what makes a movie successful and will provide recommendations to the stakeholder on how to make a successful movie.

#**2. Import and Loading**

## Load Libraries & Functions

In [1]:
#Import Libraries
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
from sqlalchemy.types import *

import pandas as pd
import numpy as np

In [2]:
!pip freeze > requirements.txt

## Load Data

In [2]:
# Open saved file and preview again
basics = pd.read_csv("Data/title_basics.csv.gz", low_memory = False)
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama
2,tt0113026,movie,The Fantasticks,The Fantasticks,0,2000,NaN,86,"Musical,Romance"
3,tt0113092,movie,For the Cause,For the Cause,0,2000,NaN,100,"Action,Adventure,Drama"
4,tt0114447,movie,The Silent Force,The Silent Force,0,2001,NaN,90,Action

In [3]:
ratings = pd.read_csv("Data/title_ratings.csv.gz", low_memory = False)
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      2002
1  tt0000002            5.8       269
2  tt0000005            6.2      2678
3  tt0000006            5.0       182
4  tt0000007            5.4       838

In [4]:
tmdb_results = pd.read_csv("Data/tmdb_results_combined.csv.gz", low_memory = False)
tmdb_results.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,...,14204632.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.105,2365.0,PG
2,tt0120467,0.0,/knok3mNReKqPTplnnqz7E4dd7mD.jpg,NaN,120000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 27, 'name...",NaN,19085.0,en,Vulgar,...,14904.0,87.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Everyone loves a clown... some more than others.,Vulgar,0.0,5.500,44.0,R
3,tt0120630,0.0,/xWG7emUlBPhsJ2MyQHqH0poeXwm.jpg,"{'id': 718551, 'name': 'Chicken Run Collection...",45000000.0,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '...",NaN,7443.0,en,Chicken Run,...,224834564.0,84.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,This ain't no chick flick. It's poultry in mot...,Chicken Run,0.0,6.764,4530.0,G
4,tt0120753,0.0,/3vUkQpnwbsFEQlMh9EORpvKJfpo.jpg,NaN,8000000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 53, 'name...",NaN,318.0,en,The Million Dollar Hotel,...,105983.0,122.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Everyone has something to hide.,The Million Dollar Hotel,0.0,5.868,295.0,R

## Split Data into tables

In [5]:
#Drop columns not needed
basics.drop(['titleType', 'originalTitle','isAdult','endYear'], axis=1, inplace=True)
#Drop columns not needed
tmdb_results = tmdb_results.filter(['imdb_id', 'revenue','budget','certification'])
tmdb_results

       imdb_id      revenue      budget certification
0            0          NaN         NaN           NaN
1    tt0118694   14204632.0    150000.0            PG
2    tt0120467      14904.0    120000.0             R
3    tt0120630  224834564.0  45000000.0             G
4    tt0120753     105983.0   8000000.0             R
..         ...          ...         ...           ...
239  tt0237534   70752904.0  29000000.0             R
240  tt0237572   29419291.0  35000000.0             R
241  tt0238112   62112895.0  57000000.0             R
242  tt0238552     894844.0  17000000.0             R
243  tt0238948   31600000.0  24000000.0         PG-13

[244 rows x 4 columns]

In [6]:
#Drop first row as it contains nulls
tmdb_results.drop((0), inplace=True)
tmdb_results.head()

     imdb_id      revenue       budget certification
1  tt0118694   14204632.0     150000.0            PG
2  tt0120467      14904.0     120000.0             R
3  tt0120630  224834564.0   45000000.0             G
4  tt0120753     105983.0    8000000.0             R
5  tt0120755  546388105.0  125000000.0         PG-13

In [7]:
#Split Genres
## create a col with a list of genres
basics['genres_split'] = basics['genres'].str.split(',')
basics

,tconst,primaryTitle,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0096056,Crime and Punishment,2002,126,Drama,[Drama]
2,tt0113026,The Fantasticks,2000,86,"Musical,Romance","[Musical, Romance]"
3,tt0113092,For the Cause,2000,100,"Action,Adventure,Drama","[Action, Adventure, Drama]"
4,tt0114447,The Silent Force,2001,90,Action,[Action]
...,...,...,...,...,...,...
5488,tt9555974,Haunted School,2001,85,Horror,[Horror]
5489,tt9578462,Crying Sky,2001,85,Drama,[Drama]
5490,tt9602302,"Get in, and Go",2000,113,Drama,[Drama]
5491,tt9683502,Bottle Blonde and Beautiful,2002,45,Drama,[Drama]
5492,tt9874290,Star Trek: Incident at Beta 9,2002,57,Sci-Fi,[Sci-Fi]

In [8]:
#Explode the column
exploded_genres = basics.explode('genres_split')
exploded_genres

,tconst,primaryTitle,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance",Romance
1,tt0096056,Crime and Punishment,2002,126,Drama,Drama
2,tt0113026,The Fantasticks,2000,86,"Musical,Romance",Musical
...,...,...,...,...,...,...
5488,tt9555974,Haunted School,2001,85,Horror,Horror
5489,tt9578462,Crying Sky,2001,85,Drama,Drama
5490,tt9602302,"Get in, and Go",2000,113,Drama,Drama
5491,tt9683502,Bottle Blonde and Beautiful,2002,45,Drama,Drama
5492,tt9874290,Star Trek: Incident at Beta 9,2002,57,Sci-Fi,Sci-Fi

In [9]:
#get unique genres
unique_genres = sorted(exploded_genres['genres_split'].unique())

In [10]:
#Create table
title_genres = exploded_genres[['tconst','genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0096056        Drama
2  tt0113026      Musical

In [11]:
#create mapper dictonary
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'History': 10,
 'Horror': 11,
 'Music': 12,
 'Musical': 13,
 'Mystery': 14,
 'News': 15,
 'Reality-TV': 16,
 'Romance': 17,
 'Sci-Fi': 18,
 'Sport': 19,
 'Talk-Show': 20,
 'Thriller': 21,
 'War': 22,
 'Western': 23}

In [12]:
## make new integer genre_id and drop string genres
title_genres['genre_id'] = title_genres['genres_split'].replace(genre_map)
title_genres = title_genres.drop(columns='genres_split')
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        17
1  tt0096056         7
2  tt0113026        13

In [13]:
#Convert map dictionary to df
genres = pd.DataFrame({'genreName':genre_map.keys(),
                             'genre_id':genre_map.values()})
genres.head()

   genreName  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

## Check Data Types

In [14]:
#Check data types
title_genres.dtypes

tconst      object
genre_id     int64
dtype: object

In [15]:
genres.dtypes

genreName    object
genre_id      int64
dtype: object

In [16]:
basics.dtypes

tconst            object
primaryTitle      object
startYear          int64
runtimeMinutes     int64
genres            object
genres_split      object
dtype: object

In [17]:
ratings.dtypes

tconst            object
averageRating    float64
numVotes           int64
dtype: object

In [18]:
tmdb_results.dtypes

imdb_id           object
revenue          float64
budget           float64
certification     object
dtype: object

In [19]:
#Drop columns not needed
basics.drop(['genres_split'], axis=1, inplace=True)

## Create Database

In [20]:
#title _basics tables
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
username = "root"
password = "admin" # (or whatever password you chose during mysql installation)
db_name = "movies"
connection_str = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"
engine = create_engine(connection_str)

In [21]:
# Check if the database exists. If not, create it.
if database_exists(connection_str) == False:
  create_database(connection_str)
else:
  print('The database already exists')

The database already exists

## Define tables and Write data

In [22]:
## Calculate max string lengths for object columns
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()
genre_len = basics['genres'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'runtimeMinutes':Integer(),
    'genres':Text(genre_len+1)}

In [23]:
# Save to sql with dtype and index=False
basics.to_sql('title_basics',engine,dtype=df_schema,if_exists='replace',index=False)
#Add primary key]
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

C:\Users\sbyrow\AppData\Local\Temp\ipykernel_23028\277271967.py:4: RemovedIn20Warning: Deprecated API features detected! These feature(s) are not compatible with SQLAlchemy 2.0. To prevent incompatible upgrades prior to updating applications, ensure requirements files are pinned to "sqlalchemy<2.0". Set environment variable SQLALCHEMY_WARN_20=1 to show all deprecation warnings.  Set environment variable SQLALCHEMY_SILENCE_UBER_WARNING=1 to silence this message. (Background on SQLAlchemy 2.0 at: https://sqlalche.me/e/b8d9)
  engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [24]:
#Check table
query = """SELECT * FROM title_basics LIMIT 5;"""
pd.read_sql(query, engine)

,tconst,primaryTitle,startYear,runtimeMinutes,genres
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance"
1,tt0096056,Crime and Punishment,2002.0,126,Drama
2,tt0113026,The Fantasticks,2000.0,86,"Musical,Romance"
3,tt0113092,For the Cause,2000.0,100,"Action,Adventure,Drama"
4,tt0114447,The Silent Force,2001.0,90,Action

In [25]:
#title_genre
## Calculate max string lengths for object columns
key_len = title_genres['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    'genre_id':Integer()}

In [26]:
# Save to sql with dtype and index=False
title_genres.to_sql('title_genres',engine,dtype=df_schema,if_exists='replace',index=False)
#Add primary key]
#engine.execute('ALTER TABLE title_genres ADD PRIMARY KEY (`tconst`);')

10843

In [27]:
#Check table
query = """SELECT * FROM title_genres LIMIT 5;"""
pd.read_sql(query, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        17
3  tt0096056         7
4  tt0113026        13

In [28]:
#genres
## Calculate max string lengths for object columns
title_len = genres['genreName'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "genre_id":Integer(),
    "genre_name": Text(title_len+1)}

In [29]:
# Save to sql with dtype and index=False
genres.to_sql('genres',engine,dtype=df_schema,if_exists='replace',index=False)
#Add primary key]
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_id`);')

In [30]:
#Check table
query = """SELECT * FROM genres LIMIT 5;"""
pd.read_sql(query, engine)

   genreName  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [31]:
#title_ratings
## Calculate max string lengths for object columns
key_len = ratings['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    'averageRating':Float(),
    'numVotes':Integer()}

In [32]:
# Save to sql with dtype and index=False
ratings.to_sql('title_ratings',engine,dtype=df_schema,if_exists='replace',index=False)
#Add p[rimary key]
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [33]:
#Check table
query = """SELECT * FROM title_ratings LIMIT 5;"""
pd.read_sql(query, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      2002
1  tt0000002            5.8       269
2  tt0000005            6.2      2678
3  tt0000006            5.0       182
4  tt0000007            5.4       838

In [34]:
#TMDB
## Calculate max string lengths for object columns
key_len = tmdb_results['imdb_id'].fillna('').map(len).max()
cert_len = tmdb_results['certification'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "imdb_id": String(key_len+1), 
    'revenue':Float(),
    'budget':Float(),
    "primaryTitle": Text(cert_len+1)}

In [35]:
# Save to sql with dtype and index=False
tmdb_results.to_sql('tmdb_data',engine,dtype=df_schema,if_exists='replace',index=False)
#Add primary key]
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [36]:
#Check table
query = """SELECT * FROM tmdb_data LIMIT 5;"""
pd.read_sql(query, engine)

     imdb_id     revenue      budget certification
0          0         NaN         NaN          None
1  tt0035423  76019000.0  48000000.0         PG-13
2  tt0118589   5271670.0  22000000.0         PG-13
3  tt0118694  14204600.0    150000.0            PG
4  tt0120467     14904.0    120000.0             R

## Show the DB Structure

In [37]:
#Check that users data was loaded
query = """SHOW TABLES;"""
pd.read_sql(query, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data

## Hypothesis Testing

- 1. Does the MPAA rating of a movie (G/PG/PG-13/R) affect how much revenue the movie generates?
  2.